Repository: LaderaJA/Trabaholink
Catalog: locale/*/LC_MESSAGES/django.po
Languages: tl

source: Home
tl: Tahanan

source: Postings
tl: Mga Trabaho

source: Announcements
tl: Mga Anunsyo

source: Messages
tl: Mga Mensahe

source: Notifications
tl: Mga Notipikasyon

source: Login
tl: Mag-login

source: Register
tl: Mag-rehistro

source: Logout
tl: Mag-logout

source: View Profile
tl: Tingnan ang Profile

source: Worker Dashboard
tl: Dashboard ng Manggagawa

source: Employer Dashboard
tl: Dashboard ng Employer

source: Admin Dashboard
tl: Dashboard ng Admin

source: Mark all as read
tl: Markahan lahat bilang nabasa

source: View all
tl: Tingnan lahat

source: Loading notifications...
tl: Naglo-load ng mga notipikasyon...

source: Submit
tl: Isumite

source: Save
tl: I-save

source: Cancel
tl: Kanselahin

source: Delete
tl: Tanggalin

source: Edit
tl: I-edit

source: Update
tl: I-update

source: Search
tl: Maghanap

source: Filter
tl: I-filter

source: Apply
tl: Mag-apply

source: Send
tl: Ipadala

source: Upload
tl: Mag-upload

source: Download
tl: Mag-download

source: Close
tl: Isara

source: Back
tl: Bumalik

source: Next
tl: Susunod

source: Previous
tl: Nakaraan

source: Continue
tl: Magpatuloy

source: Confirm
tl: Kumpirmahin

source: Yes
tl: Oo

source: No
tl: Hindi

source: Browse Jobs
tl: Mag-browse ng Trabaho

source: Find Services
tl: Maghanap ng Serbisyo

source: Join Now
tl: Sumali Ngayon

source: Click to read more
tl: I-click para magbasa pa

source: Read more
tl: Magbasa pa

source: Jobs
tl: Mga Trabaho

source: Find Jobs
tl: Maghanap ng Trabaho

source: Post a Job
tl: Mag-post ng Trabaho

source: Job Title
tl: Titulo ng Trabaho

source: Job Description
tl: Deskripsyon ng Trabaho

source: Location
tl: Lokasyon

source: Salary
tl: Sahod

source: Requirements
tl: Mga Kinakailangan

source: Apply Now
tl: Mag-apply Ngayon

source: Application
tl: Aplikasyon

source: Applications
tl: Mga Aplikasyon

source: Active Jobs
tl: Mga Aktibong Trabaho

source: Worker
tl: Manggagawa

source: Posted
tl: Nai-post

source: Services
tl: Mga Serbisyo

source: My Services
tl: Aking mga Serbisyo

source: Service Category
tl: Kategorya ng Serbisyo

source: Edit Profile
tl: I-edit ang Profile

source: Full Name
tl: Buong Pangalan

source: Phone
tl: Telepono

source: Skills
tl: Mga Kasanayan

source: Change Password
tl: Baguhin ang Password

source: Old Password
tl: Lumang Password

source: New Password
tl: Bagong Password

source: Confirm Password
tl: Kumpirmahin ang Password

source: Forgot Password?
tl: Nakalimutan ang Password?

source: Create Account
tl: Gumawa ng Account

source: Welcome back!
tl: Maligayang pagbabalik!

source: Message
tl: Mensahe

source: Send Message
tl: Magpadala ng Mensahe

source: Type a message...
tl: Mag-type ng mensahe...

source: Conversations
tl: Mga Pag-uusap

source: Active
tl: Aktibo

source: Pending
tl: Naghihintay

source: Completed
tl: Natapos na

source: Cancelled
tl: Kinansela

source: Welcome
tl: Maligayang pagdating

source: Loading...
tl: Naglo-load...

source: Please wait...
tl: Pakihintay...

source: Success!
tl: Tagumpay!

source: Error occurred
tl: May naganap na error

source: Try again
tl: Subukan muli

source: Learn more
tl: Alamin pa

source: See all
tl: Tingnan lahat

source: Help
tl: Tulong

source: Contact
tl: Makipag-ugnayan

source: Settings
tl: Mga Setting

source: Connect. Collaborate. Succeed.
tl: Kumonekta. Makipagtulungan. Magtagumpay.

source: Your gateway to endless opportunities. Find the perfect job or discover talented professionals ready to bring your vision to life.
tl: Ang iyong daan tungo sa walang hanggang oportunidad. Maghanap ng perpektong trabaho o tuklasin ang mga bihasang propesyonal na handang isabuhay ang iyong pangarap.

source: Users
tl: Mga Gumagamit

source: Welcome to TrabahoLink!
tl: Maligayang pagdating sa TrabahoLink!

source: Join thousands of professionals finding their dream opportunities
tl: Sumali sa libu-libong propesyonal na naghahanap ng kanilang mga pangarap na oportunidad

source: Total Jobs
tl: Kabuuang Trabaho

source: Latest Opportunities
tl: Pinakabagong Oportunidad

source: Discover the newest job postings
tl: Tuklasin ang pinakabagong job postings

source: No jobs available at the moment. Check back soon!
tl: Walang available na trabaho sa ngayon. Bumalik mamaya!

source: Get started in three simple steps
tl: Magsimula sa tatlong simpleng hakbang

source: 1. Create Your Profile
tl: 1. Gumawa ng Iyong Profile

source: Sign up for free and build your professional profile. Showcase your skills, experience, and portfolio to stand out.
tl: Mag-sign up nang libre at buuin ang iyong propesyonal na profile. Ipakita ang iyong mga kasanayan, karanasan, at portfolio para mag-standout.

source: 2. Browse & Connect
tl: 2. Mag-browse at Kumonekta

source: Explore thousands of job listings or find talented professionals. Use our advanced filters to find the perfect match.
tl: Tuklasin ang libu-libong job listings o maghanap ng bihasang propesyonal. Gamitin ang aming advanced filters para makahanap ng perpektong match.

source: 3. Start Working
tl: 3. Magsimulang Magtrabaho

source: Get hired or hire the right talent. Communicate securely, track progress, and build lasting professional relationships.
tl: Matanggap o mag-hire ng tamang talento. Makipag-ugnayan nang ligtas, subaybayan ang progreso, at bumuo ng pangmatagalang propesyonal na relasyon.

source: Why Choose TrabahoLink?
tl: Bakit Piliin ang TrabahoLink?

source: Everything you need to succeed
tl: Lahat ng kailangan mo para magtagumpay

source: Secure & Trusted
tl: Ligtas at Mapagkakatiwalaan

source: Your safety and privacy are our top priorities. All users are verified.
tl: Ang iyong kaligtasan at privacy ay aming pangunahing priority. Lahat ng users ay na-verify.

source: Wide Network
tl: Malawak na Network

source: Connect with professionals and companies across various industries.
tl: Kumonekta sa mga propesyonal at kumpanya sa iba't ibang industriya.

source: Fast & Easy
tl: Mabilis at Madali

source: Get started in minutes with our simple and intuitive platform.
tl: Magsimula sa loob ng ilang minuto sa aming simple at intuitive na platform.

source: Ready to explore new opportunities or manage your profile?
tl: Handa nang tuklasin ang mga bagong oportunidad o pamahalaan ang iyong profile?

source: My Profile
tl: Aking Profile

source: Ready to Get Started?
tl: Handa Nang Magsimula?

source: Join our community today and unlock endless opportunities for growth and success.
tl: Sumali sa aming komunidad ngayon at buksan ang walang hanggang oportunidad para sa paglaki at tagumpay.

source: Sign Up Free
tl: Mag-sign Up Nang Libre

source: Explore Jobs
tl: Tuklasin ang mga Trabaho

source: View Details
tl: Tingnan ang mga Detalye

source: Show More
tl: Ipakita pa

source: Load More
tl: Mag-load pa

source: Language
tl: Wika

source: Sign in to continue your journey to success
tl: Mag-sign in para ipagpatuloy ang iyong paglalakbay tungo sa tagumpay

source: Secure & Trusted Platform
tl: Ligtas at Mapagkakatiwalaang Platform

source: Connect with Opportunities
tl: Kumonekta sa mga Oportunidad

source: Build Your Career
tl: Bumuo ng Iyong Karera

source: Enter your credentials to access your account
tl: Ilagay ang iyong mga kredensyal upang ma-access ang iyong account

source: Your username and password didn't match. Please try again.
tl: Hindi nagtugma ang iyong username at password. Pakisubukan muli.

source: Forgot password?
tl: Nakalimutan ang password?

source: OR CONTINUE WITH
tl: O MAGPATULOY SA

source: Continue with Google
tl: Magpatuloy sa Google

source: Don't have an account?
tl: Wala kang account?

source: First Name
tl: Pangalan

source: Last Name
tl: Apelyido

source: Phone Number
tl: Numero ng Telepono

source: Date of Birth
tl: Petsa ng Kapanganakan

source: Gender
tl: Kasarian

source: Male
tl: Lalaki

source: Female
tl: Babae

source: Other
tl: Iba pa

source: City
tl: Lungsod

source: Province
tl: Probinsya

source: Description
tl: Deskripsyon

source: Select
tl: Pumili

source: Choose File
tl: Pumili ng File

source: Required
tl: Kinakailangan

source: Optional
tl: Opsyonal

source: Warning
tl: Babala

source: Information
tl: Impormasyon

source: Are you sure?
tl: Sigurado ka ba?

source: This action cannot be undone
tl: Hindi maaaring bawiin ang aksyong ito

source: Processing...
tl: Pinoproseso...

source: Saving...
tl: Sine-save...

source: No results found
tl: Walang nahanap na resulta

source: Go back
tl: Bumalik

source: Company
tl: Kumpanya

source: Employment Type
tl: Uri ng Trabaho

source: Contract
tl: Kontrata

source: Temporary
tl: Pansamantala

source: Experience Level
tl: Antas ng Karanasan

source: Salary Range
tl: Saklaw ng Sahod

source: Minimum Salary
tl: Pinakamababang Sahod

source: Maximum Salary
tl: Pinakamataas na Sahod

source: Qualifications
tl: Mga Kwalipikasyon

source: Responsibilities
tl: Mga Responsibilidad

source: Benefits
tl: Mga Benepisyo

source: Application Deadline
tl: Deadline ng Aplikasyon

source: Posted on
tl: Nai-post noong

source: Expires on
tl: Mag-e-expire noong

source: Apply for this position
tl: Mag-apply para sa posisyong ito

source: View Job Details
tl: Tingnan ang mga Detalye ng Trabaho

source: No jobs available
tl: Walang available na trabaho

source: Search jobs...
tl: Maghanap ng trabaho...

source: Filter by category
tl: I-filter ayon sa kategorya

source: Filter by location
tl: I-filter ayon sa lokasyon

source: Filter by salary
tl: I-filter ayon sa sahod

source: Sort by
tl: Ayusin ayon sa

source: Newest first
tl: Pinakabago muna

source: Oldest first
tl: Pinakaluma muna

source: Highest salary
tl: Pinakamataas na sahod

source: Lowest salary
tl: Pinakamababang sahod

source: Profile Picture
tl: Larawan ng Profile

source: About Me
tl: Tungkol sa Akin

source: Work Experience
tl: Karanasan sa Trabaho

source: Education
tl: Edukasyon

source: Certifications
tl: Mga Sertipiko

source: Add
tl: Magdagdag

source: Remove
tl: Alisin

source: Add Experience
tl: Magdagdag ng Karanasan

source: Add Education
tl: Magdagdag ng Edukasyon

source: Add Skill
tl: Magdagdag ng Kasanayan

source: Save Changes
tl: I-save ang mga Pagbabago

source: Cancel Changes
tl: Kanselahin ang mga Pagbabago

source: Your changes have been saved
tl: Na-save na ang iyong mga pagbabago

source: Failed to save changes
tl: Nabigo sa pag-save ng mga pagbabago

source: Overview
tl: Pangkalahatang-ideya

source: Recent Activity
tl: Kamakailang Aktibidad

source: My Applications
tl: Aking mga Aplikasyon

source: Saved Jobs
tl: Naka-save na Trabaho

source: Account Settings
tl: Mga Setting ng Account

source: Mark as read
tl: Markahan bilang nabasa

source: Delete notification
tl: Tanggalin ang notipikasyon

source: No new notifications
tl: Walang bagong notipikasyon

source: You have
tl: Mayroon kang

source: new notification
tl: bagong notipikasyon

source: new notifications
tl: mga bagong notipikasyon

source: just now
tl: ngayon lang

source: minute ago
tl: minutong nakaraan

source: minutes ago
tl: mga minutong nakaraan

source: hour ago
tl: oras na nakaraan

source: hours ago
tl: mga oras na nakaraan

source: day ago
tl: araw na nakaraan

source: days ago
tl: mga araw na nakaraan

source: week ago
tl: linggo na nakaraan

source: weeks ago
tl: mga linggo na nakaraan

source: month ago
tl: buwan na nakaraan

source: months ago
tl: mga buwan na nakaraan

source: year ago
tl: taon na nakaraan

source: years ago
tl: mga taon na nakaraan

source: Join Us Today!
tl: Sumali sa Amin Ngayon!

source: Create your account and start your journey to success
tl: Gumawa ng iyong account at simulan ang iyong paglalakbay tungo sa tagumpay

source: Free Registration
tl: Libreng Pagrehistro

source: Access to Opportunities
tl: Access sa mga Oportunidad

source: Build Your Network
tl: Bumuo ng Iyong Network

source: Fill in your details to get started
tl: Punan ang iyong mga detalye para magsimula

source: I am a:
tl: Ako ay:

source: I agree to the
tl: Sumasang-ayon ako sa

source: Terms and Conditions
tl: Mga Tuntunin at Kundisyon

source: and the
tl: at sa

source: Privacy Consent Agreement
tl: Kasunduan sa Privacy

source: Sign up with Google
tl: Mag-sign up sa Google

source: Already have an account?
tl: Mayroon ka nang account?

source: Both
tl: Pareho

source: Select your role
tl: Pumili ng iyong papel

source: This field is required
tl: Kinakailangan ang field na ito

source: Please enter a valid email
tl: Pakitagay ng wastong email

source: Passwords must match
tl: Dapat magkatugma ang mga password

source: Password is too short
tl: Masyadong maikli ang password

source: Password is too common
tl: Masyadong karaniwan ang password

source: Must contain at least 8 characters
tl: Dapat may kahit 8 karakter

source: Loading
tl: Naglo-load

source: All Categories
tl: Lahat ng Kategorya

source: All Locations
tl: Lahat ng Lokasyon

source: Clear Filters
tl: I-clear ang mga Filter

source: Apply Filters
tl: Ilapat ang mga Filter

source: jobs found
tl: trabahong nahanap

source: No jobs match your criteria
tl: Walang trabahong tumutugma sa iyong pamantayan

source: Showing
tl: Nagpapakita ng

source: to
tl: hanggang

source: of
tl: sa

source: results
tl: mga resulta

source: Posted by
tl: Nai-post ni

source: Applicants
tl: Mga Aplikante

source: View Application
tl: Tingnan ang Aplikasyon

source: Already Applied
tl: Nag-apply Na

source: Job Closed
tl: Sarado na ang Trabaho

source: Save Job
tl: I-save ang Trabaho

source: Share
tl: I-share

source: Report Job
tl: I-report ang Trabaho

source: Apply for Job
tl: Mag-apply para sa Trabaho

source: Your Application
tl: Iyong Aplikasyon

source: Tell the employer why you're a good fit
tl: Sabihin sa employer kung bakit ikaw ay swak

source: Attach Resume
tl: Maglakip ng Resume

source: Attach Portfolio
tl: Maglakip ng Portfolio

source: Expected Salary
tl: Inaasahang Sahod

source: Available to Start
tl: Available na Magsimula

source: Immediately
tl: Kaagad

source: Within 1 week
tl: Sa loob ng 1 linggo

source: Within 2 weeks
tl: Sa loob ng 2 linggo

source: Within 1 month
tl: Sa loob ng 1 buwan

source: Submit Application
tl: Isumite ang Aplikasyon

source: Application submitted successfully
tl: Matagumpay na naisumite ang aplikasyon

source: You have already applied for this job
tl: Nag-apply ka na para sa trabahong ito

source: Personal Information
tl: Personal na Impormasyon

source: Contact Information
tl: Impormasyon sa Pakikipag-ugnayan

source: Professional Information
tl: Propesyonal na Impormasyon

source: Upload Photo
tl: Mag-upload ng Larawan

source: Change Photo
tl: Palitan ang Larawan

source: Remove Photo
tl: Tanggalin ang Larawan

source: Drag and drop files here
tl: I-drag at i-drop ang mga file dito

source: or click to browse
tl: o mag-click para mag-browse

source: Maximum file size
tl: Pinakamataas na laki ng file

source: Allowed formats
tl: Mga pinapayagang format

source: Update Profile
tl: I-update ang Profile

source: Profile updated successfully
tl: Matagumpay na na-update ang profile

source: Failed to update profile
tl: Nabigo sa pag-update ng profile

source: Quick Stats
tl: Mabilis na Stats

source: Jobs Posted
tl: Mga Nai-post na Trabaho

source: Applications Received
tl: Mga Natanggap na Aplikasyon

source: Applications Sent
tl: Mga Ipinadala na Aplikasyon

source: Profile Views
tl: Mga Pagtingin sa Profile

source: Manage Jobs
tl: Pamahalaan ang mga Trabaho

source: View Applications
tl: Tingnan ang mga Aplikasyon

source: Post New Job
tl: Mag-post ng Bagong Trabaho

source: Edit Job
tl: I-edit ang Trabaho

source: Delete Job
tl: Tanggalin ang Trabaho

source: Are you sure you want to delete this job?
tl: Sigurado ka bang gusto mong tanggalin ang trabahong ito?

source: This will remove all applications
tl: Tatanggalin nito ang lahat ng aplikasyon

source: Job deleted successfully
tl: Matagumpay na natanggal ang trabaho

source: Service Categories
tl: Mga Kategorya ng Serbisyo

source: Rate per Hour
tl: Bayad bawat Oras

source: Minimum Rate
tl: Pinakamababang Bayad

source: Maximum Rate
tl: Pinakamataas na Bayad

source: Service Area
tl: Lugar ng Serbisyo

source: Years of Experience
tl: Taon ng Karanasan

source: Portfolio Items
tl: Mga Item sa Portfolio

source: Client Reviews
tl: Mga Review ng Kliyente

source: Book Service
tl: Mag-book ng Serbisyo

source: Contact Provider
tl: Makipag-ugnayan sa Provider

source: Request Quote
tl: Humiling ng Quote

source: Service booked successfully
tl: Matagumpay na naka-book ang serbisyo

source: New Conversation
tl: Bagong Pag-uusap

source: Start typing...
tl: Magsimulang mag-type...

source: Attach File
tl: Maglakip ng File

source: No messages yet
tl: Wala pang mga mensahe

source: Start a conversation
tl: Magsimula ng pag-uusap

source: Delivered
tl: Naihatid na

source: Seen
tl: Nakita na

source: Delete Conversation
tl: Tanggalin ang Pag-uusap

source: Block User
tl: I-block ang User

source: Report User
tl: I-report ang User

source: General Settings
tl: Pangkalahatang Settings

source: Privacy Settings
tl: Mga Setting ng Privacy

source: Notification Settings
tl: Mga Setting ng Notipikasyon

source: Email Preferences
tl: Mga Kagustuhan sa Email

source: Security Settings
tl: Mga Setting ng Seguridad

source: Enable
tl: I-enable

source: Disable
tl: I-disable

source: Deactivate Account
tl: I-deactivate ang Account

source: Delete Account
tl: Tanggalin ang Account

source: Download Your Data
tl: I-download ang Iyong Data

source: Verify Your Identity
tl: I-verify ang Iyong Pagkakakilanlan

source: Upload ID
tl: Mag-upload ng ID

source: Take Selfie
tl: Mag-selfie

source: Verification Pending
tl: Naghihintay ng Verification

source: Verified
tl: Na-verify

source: Verification Failed
tl: Nabigo ang Verification

source: Try Again
tl: Subukan Muli

source: Print
tl: I-print

source: Export
tl: I-export

source: Import
tl: I-import

source: Refresh
tl: I-refresh

source: Expand
tl: Palawakin

source: Collapse
tl: I-collapse

source: Show All
tl: Ipakita Lahat

source: Hide
tl: Itago

source: More Options
tl: Higit Pang Opsyon

source: Less
tl: Mas Kaunti

source: All
tl: Lahat

source: None
tl: Wala

source: Select All
tl: Piliin Lahat

source: Deselect All
tl: I-deselect Lahat

source: Undo
tl: I-undo

source: Redo
tl: I-redo

source: Stay updated with the latest news and updates from TrabahoLink
tl: Manatiling updated sa pinakabagong balita at updates mula sa TrabahoLink

source: Create Announcement
tl: Gumawa ng Anunsyo

source: Announcement
tl: Anunsyo

source: Read More
tl: Magbasa pa

source: Job Opportunities
tl: Mga Oportunidad sa Trabaho

source: Find your next opportunity from %(count)s available positions
tl: Hanapin ang iyong susunod na oportunidad mula sa %(count)s available na posisyon

source: Categories
tl: Mga Kategorya

source: Search by job title, skills, or location...
tl: Maghanap ayon sa titulo ng trabaho, kasanayan, o lokasyon...

source: Filters
tl: Mga Filter

source: Category
tl: Kategorya

source: Municipality
tl: Munisipalidad

source: Enter municipality
tl: Ilagay ang munisipalidad

source: Enter barangay
tl: Ilagay ang barangay

source: Min Budget
tl: Pinakamababang Budget

source: Max Budget
tl: Pinakamataas na Budget

source: Status
tl: Katayuan

source: All Status
tl: Lahat ng Katayuan

source: Hiring
tl: Nag-hire

source: Closed
tl: Sarado

source: Welcome back
tl: Maligayang pagbabalik

source: Service Providers
tl: Mga Tagapagbigay ng Serbisyo

source: Find skilled professionals for your needs
tl: Maghanap ng mga bihasang propesyonal para sa iyong pangangailangan

source: Browse all available services
tl: Mag-browse ng lahat ng available na serbisyo

source: Manage your service offerings
tl: Pamahalaan ang iyong mga alok na serbisyo

source: Switch Language
tl: Palitan ang Wika
